app/views/remote_study/index.html.erb

          <h4 class="card-title">
            <div class="text-center">Завдання: <%= RemoteStudy.where(subject: @subjects[i][1], active: true, class_room: current_user.class_room).count %></div>
---
SELECT COUNT(*) FROM "remote_studies" WHERE "remote_studies"."subject" = $1 AND "remote_studies"."active" = $2 AND "remote_studies"."class_room" = $3  [["subject", "math"], ["active", "t"], ["class_room", 5]]