app/views/pdfs/index.html.erb

SELECT "pdfs".* FROM "pdfs" ORDER BY "pdfs"."created_at" DESC
---
    <div class="card-footer">
    <% if pdf.path.split('.').last == 'pdf' %>