app/controllers/home_works_controller.rb

  def edit
    @home_task = HomeTask.find(params[:id])
---
SELECT  "home_tasks".* FROM "home_tasks" WHERE "home_tasks"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]

  def destroy
    @home_task = HomeTask.find(params[:id])
    @home_task.destroy
---
SELECT  "home_tasks".* FROM "home_tasks" WHERE "home_tasks"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "home_tasks" WHERE "home_tasks"."id" = $1  [["id", 980190962]]

  def update
    @home_task = HomeTask.find(params[:id])
---
SELECT  "home_tasks".* FROM "home_tasks" WHERE "home_tasks"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]