app/controllers/pdfs_controller.rb

  def index
    @file = { "docx" => '/docx.jpg', "pdf" => "/pdf.png", "xlsx" => "/xls.jpg", "pptx" => "/pptx.jpg",
              "xls" => "/xls.jpg", "ppt" => "/pptx.jpg", "doc" => '/docx.jpg'}
    @pdfs = Pdf.order(created_at: :desc)
---
SELECT "pdfs".* FROM "pdfs" ORDER BY "pdfs"."created_at" DESC

  def show
    @pdf = Pdf.find(params[:id])
---
SELECT  "pdfs".* FROM "pdfs" WHERE "pdfs"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]

  def edit
    @pdf = Pdf.find(params[:id])
---
SELECT  "pdfs".* FROM "pdfs" WHERE "pdfs"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]

  def update
    @pdf = Pdf.find(params[:id])
---
SELECT  "pdfs".* FROM "pdfs" WHERE "pdfs"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]

  def destroy
    @pdf = Pdf.find(params[:id])
    @pdf.destroy
---
SELECT  "pdfs".* FROM "pdfs" WHERE "pdfs"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "pdfs" WHERE "pdfs"."id" = $1  [["id", 980190962]]