app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "who", "logo") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "MyString"], ["body", "MyString"], ["created_at", "2019-05-27 07:14:46.753852"], ["updated_at", "2019-05-27 07:14:46.753852"], ["who", 0], ["logo", nil]]
---
  def create
    @post = Post.new(post_params)
    redirect_to posts_path, notice: 'Новина була успішно створена' if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "asd"], ["body", "123"], ["updated_at", "2019-08-14 19:46:58.505506"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)

SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 15], ["OFFSET", 0]]
---
  def index
    @shows = Post.order(created_at: :desc).paginate(page: params[:page], per_page: 15)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
  def show
    @shows = Post.find(params[:id])