app/controllers/remote_study_controller.rb

  def show
    @task = RemoteStudy.where(class_room: current_user.class_room, subject: params[:remote_study_id], active: true)
---
SELECT "remote_studies".* FROM "remote_studies" WHERE "remote_studies"."class_room" = $1 AND "remote_studies"."subject" IS NULL AND "remote_studies"."active" = $2  [["class_room", 5], ["active", "t"]]

  def create
    @task = RemoteStudy.new(post_params)
    redirect_to @task if @task.save
---
INSERT INTO "remote_studies" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "MyString"], ["body", "MyString"], ["created_at", "2019-05-26 16:33:57.480759"], ["updated_at", "2019-05-26 16:33:57.480759"]]